src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаПроизводство2_2</name>
  <registerRecords>InformationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеПроизводственныхПроцессов</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Очередь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>15</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПодДеятельность</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ЗаказДавальца2_5</types>
      <types>DocumentRef.ЗаказНаРемонт</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ЗаказДавальца</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмещениеВыпуска</name>
    <type>
      <types>EnumRef.СпособыПривязкиОперацийПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НачатьНеРанее</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПродукция</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбособления</name>
    <type>
      <types>EnumRef.ВариантыОбособленияМатериаловВПроизводстве</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорНеОбязателен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроизводственногоПроцесса</name>
    <type>
      <types>EnumRef.ТипыПроизводственныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределенияЗатратНаВыходныеИзделия</name>
    <type>
      <types>EnumRef.СпособыРаспределенияЗатратНаВыходныеИзделия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособлениеПолуфабрикатовПоНазначениюЭтаповНеИспользуется</name>
    <comment>Служебный реквизит для поддержки перехода с предыдущих версий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказовНаПроизводство2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартияПроизводства</name>
    <type>
      <types>CatalogRef.ПартииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеОбеспечениеМатериаловИРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическаяСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УкрупненныйЗаказПоНазначениямПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <comment>Уникальный идентификатор ссылки</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторСтрока</name>
    <comment>Уникальный идентификатор ссылки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <type>
        <types>CatalogRef.ПричиныОтменыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимостиНаЕдиницу</name>
      <comment>Служебный реквизит для автоматического заполнения доли стоимости</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписатьНаРасходы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <type>
        <types>Characteristic.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючНоменклатура</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonModules/УправлениеПроизводствомВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Управление производством: содержит процедуры для управления производством.
// Модуль входит в подсистему "УправлениеПредприятием".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует представление заказа на производство.
//
// Параметры:
//  Ссылка	 - ДокументСсылка.ЗаказНаПроизводство2_2 - заказ на производство
//  Префикс	 - Строка								 - префикс.
// 
// Возвращаемое значение:
//  Строка - представление заказа на производство.
//
Функция ПредставлениеЗаказа(Ссылка, Префикс = Неопределено) Экспорт
	
	Возврат Документы.ЗаказНаПроизводство2_2.ПредставлениеЗаказа(Ссылка, Префикс);
	
КонецФункции

// Формирует полное представление заказа на производство.
//
// Параметры:
//  Ссылка	 - ДокументСсылка.ЗаказНаПроизводство2_2 - заказ на производство
//  Префикс	 - Строка								 - префикс.
// 
// Возвращаемое значение:
//  Строка - полное представление заказа на производство.
//
Функция ПолноеПредставлениеЗаказа(Ссылка, Префикс = Неопределено) Экспорт
	
	Возврат Документы.ЗаказНаПроизводство2_2.ПолноеПредставлениеЗаказа(Ссылка, Префикс);
	
КонецФункции

// Формирует представление этапа производства по данным документа.
//
// Параметры:
//  ДанныеЭтапа - см. Документы.ЭтапПроизводства2_2.ПредставлениеЭтапа.
// 
// Возвращаемое значение:
//  Строка - представление этапа производства.
//
Функция ПредставлениеЭтапа(ДанныеЭтапа) Экспорт
	
	Возврат Документы.ЭтапПроизводства2_2.ПредставлениеЭтапа(ДанныеЭтапа);
	
КонецФункции

// Устанавливает дату с учетом переданной отметки
//
// Параметры:
//  Отметка		 - Булево	 - отметка
//  ПолеДата	 - Дата		 - реквизит, в котором нужно установить дату
//  ДатаСобытия	 - Дата		 - устанавливаемая дата
//  Затереть	 - Булево	 - признак, что дату нужно установить принудительно.
//
Процедура УстановитьДатуПоОтметке(Отметка, ПолеДата, ДатаСобытия = Неопределено, Затереть = Ложь) Экспорт
	
	УправлениеПроизводством.УстановитьДатуПоОтметке(
				Отметка,
				ПолеДата, ДатаСобытия, Затереть);
	
КонецПроцедуры

// Возвращает значения заполнения нового этапа производства
//
// Параметры:
//  Распоряжение				 - ДокументСсылка.ЗаказНаПроизводство2_2 			 - заказ на производство
//  НазначениеПродукция			 - СправочникСсылка.Назначения						 - назначение продукции ( при обособлении по целевому назначению )
//  ПартияПроизводства			 - СправочникСсылка.ПартииПроизводства				 - партия производства
//  ТипПроизводственногоПроцесса - ПеречислениеСсылка.ТипыПроизводственныхПроцессов	 - тип производственного процесса.
//  Спецификация				 - СправочникСсылка.РесурсныеСпецификации			 - ресурсная спецификация.
// 
// Возвращаемое значение:
//  Структура - значения заполнения нового этапа производства:
//   * Распоряжение                     - ДокументСсылка.ЗаказНаПроизводство2_2 -
//   * ДинамическаяСтруктура            - Булево -
//   * Организация                      - СправочникСсылка.Организации -
//   * ХозяйственнаяОперация            - ПеречислениеСсылка.ХозяйственныеОперации -
//   * НаправлениеДеятельности          - СправочникСсылка.НаправленияДеятельности -
//   * Партнер                          - СправочникСсылка.Партнеры -
//   * Договор                          - СправочникСсылка.ДоговорыКонтрагентов -
//   * ВыпускПодДеятельность            - ПеречислениеСсылка.ТипыНалогообложенияНДС -
//   * ОперацияКакРаспоряжениеВыработки - см. УправлениеПроизводством.ИспользуетсяОперацияКакРаспоряжениеВыработки
//   * ВидЦены                          - см. Справочники.ВидыЦен.ВидЦеныПлановойСтоимостиТМЦ
//   * Валюта                           - см. ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета
//   * ВариантПриемкиТоваров            - ПеречислениеСсылка.ВариантыПриемкиТоваров -
//   * НазначениеПродукция              - СправочникСсылка.Назначения -
//   * ПартияПроизводства               - СправочникСсылка.ПартииПроизводства -
//   * ТипПроизводственногоПроцесса     - ПеречислениеСсылка.ТипыПроизводственныхПроцессов -
//   * Спецификация                     - СправочникСсылка.РесурсныеСпецификации -
//   * ОтветственноеПодразделение       - см. Справочники.РесурсныеСпецификации.ОтветственноеПодразделение
//
Функция ЗначенияЗаполненияНовогоЭтапаПроизводства(Распоряжение,
													НазначениеПродукция,
													ПартияПроизводства,
													ТипПроизводственногоПроцесса,
													Спецификация) Экспорт
	
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("Распоряжение", "Ссылка");
	ИменаРеквизитов.Вставить("ДинамическаяСтруктура");
	ИменаРеквизитов.Вставить("Организация");
	ИменаРеквизитов.Вставить("ХозяйственнаяОперация");
	ИменаРеквизитов.Вставить("НаправлениеДеятельности");
	ИменаРеквизитов.Вставить("Партнер");
	ИменаРеквизитов.Вставить("Договор");
	ИменаРеквизитов.Вставить("ВыпускПодДеятельность", "ЗаказПодДеятельность");
	
	ЗначенияЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Распоряжение, ИменаРеквизитов);
	
	ОперацияКакРаспоряжениеВыработки = УправлениеПроизводством.ИспользуетсяОперацияКакРаспоряжениеВыработки(
		ТекущаяДатаСеанса());
	
	ЗначенияЗаполнения.Вставить("ОперацияКакРаспоряжениеВыработки", ОперацияКакРаспоряжениеВыработки);
	
	Если ЗначениеЗаполнено(НазначениеПродукция) Тогда
		НаправлениеДеятельности = УправлениеПроизводствомПовтИсп.НаправлениеДеятельностиНазначенияПродукции(НазначениеПродукция);
		ЗначенияЗаполнения.НаправлениеДеятельности = НаправлениеДеятельности;
	КонецЕсли;
	
	ВидЦены = Справочники.ВидыЦен.ВидЦеныПлановойСтоимостиТМЦ();
	ЗначенияЗаполнения.Вставить("ВидЦены", ВидЦены);
	
	Валюта = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(Справочники.ВидыЦен.ПолучитьРеквизитыВидаЦены(ВидЦены).ВалютаЦены);
	ЗначенияЗаполнения.Вставить("Валюта", Валюта);
	
	ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров.Получить();
	ЗначенияЗаполнения.Вставить("ВариантПриемкиТоваров", ВариантПриемкиТоваров);
	
	ЗначенияЗаполнения.Вставить("Распоряжение", Распоряжение);
	ЗначенияЗаполнения.Вставить("НазначениеПродукция", НазначениеПродукция);
	
	ЗначенияЗаполнения.Вставить("ПартияПроизводства", ПартияПроизводства);
	
	ЗначенияЗаполнения.Вставить("ТипПроизводственногоПроцесса", ТипПроизводственногоПроцесса);
	ЗначенияЗаполнения.Вставить("Спецификация", Спецификация);
	
	ОтветственноеПодразделение = Справочники.РесурсныеСпецификации.ОтветственноеПодразделение(Спецификация);
	ЗначенияЗаполнения.Вставить("ОтветственноеПодразделение", ОтветственноеПодразделение);
	
	Возврат ЗначенияЗаполнения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  МассивСсылок - см. Документы.ЭтапПроизводства2_2.ПодразделенияИсполнители.МассивСсылок
// 
// Возвращаемое значение:
//  см. Документы.ЭтапПроизводства2_2.ПодразделенияИсполнители
//
Функция ПодразделенияИсполнители(МассивСсылок) Экспорт
	
	Возврат Документы.ЭтапПроизводства2_2.ПодразделенияИсполнители(МассивСсылок);
	
КонецФункции

// Параметры:
//  МассивЭтапов - Массив из ДокументСсылка.ЭтапПроизводства2_2
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЭтапПроизводства2_2 - список доступных для удаления этапов производства
//
Функция СписокДоступныхДляУдаленияЭтаповПроизводства(МассивЭтапов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = Документы.ЭтапПроизводства2_2.ТекстЗапросаСписокДоступныхДляУдаленияЭтаповПроизводства();
	Запрос.УстановитьПараметр("МассивСсылок", МассивЭтапов);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

//++ Устарело_Производство21

// Возвращаемое значение:
//  Булево -
//
Функция ЕстьНезавершенныеОперацииВПроизводстве21() Экспорт
	Возврат УправлениеПроизводством.ЕстьНезавершенныеОперацииВПроизводстве21();
КонецФункции
//-- Устарело_Производство21

// Параметры:
//  ПартияПроизводства - см. Документы.ЭтапПроизводства2_2.ЭтапПоШтрихкодуПартииПроизводства.ПартияПроизводства
// 
// Возвращаемое значение:
//  ДокументСсылка.ЭтапПроизводства2_2, Неопределено -
//
Функция ЭтапПоШтрихкодуПартииПроизводства(ПартияПроизводства) Экспорт
	
	Возврат Документы.ЭтапПроизводства2_2.ЭтапПоШтрихкодуПартииПроизводства(ПартияПроизводства);
	
КонецФункции

// Возвращаемое значение:
//  Булево -
//
Функция ДинамическаяСтруктураЗаказовНаПроизводство() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство");
	
КонецФункции

Процедура УстранитьКонфликтыВОчередиЗаказовНаПроизводство(Заказ, Отказ) Экспорт
	
	Документы.ЗаказНаПроизводство2_2.УстранитьКонфликтыВОчереди(Заказ, Отказ);
	
КонецПроцедуры

#КонецОбласти
